#include <iostream>
using namespace std;
int schedule()
{
    setlocale(LC_ALL, "Russian");

    int chislo;
    int vibor;
    do {
        cout << "Выберите день недели (от 1 до 6)\n";
        cout << "-------------------------------------\n";
        cout << "Введите число \n";
        cin >> chislo;
        switch (chislo)
        {
        case 1:
            cout << "-------------------------------------\n";
            cout << "Понедельник \n";
            cout << "1. СЯП \n";
            cout << "2. ОАиП \n";
            cout << "3. КЯР \n";
            cout << "-------------------------------------\n";
            break;
        case 2:
            cout << "-------------------------------------\n";
            cout << "Вторник \n";
            cout << "1. ОАиП \n";
            cout << "2. ОАиП \n";
            cout << "3. ЛинАиАналГеом \n";
            cout << "-------------------------------------\n";
            break;
        case 3:
            cout << "-------------------------------------\n";
            cout << "Среда  \n";
            cout << "1. АЛОВС \n";
            cout << "2. Физра \n";
            cout << "3. МатАн \n";
            cout << "-------------------------------------\n";
            break;
        case 4:
            cout << "-------------------------------------\n";
            cout << "Четверг \n";
            cout << "1. ТРПО \n";
            cout << "2. ТРПО \n";
            cout << "-------------------------------------\n";
            break;
        case 5:
            cout << "-------------------------------------\n";
            cout << "2. СЯП \n";
            cout << "3. МатАн \n";
            cout << "-------------------------------------\n";
            break;
        case 6:
            cout << "-------------------------------------\n";
            cout << "1. МатАн \n";
            cout << "2. Физра \n";
            cout << "3. КЯР \n";
            cout << "4. Англ \n";
            cout << "-------------------------------------\n";
            break;
        default:
            break;
        }
        cout << "Желаете продолжить? 1 - да";
        cin >> vibor;
    } while (vibor == 1);
}